mod commands;
mod config;
mod constants;
mod events;
mod functions;
mod structure;

use anyhow::Result;
use colored::Colorize;
use config::AppState;

#[tokio::main]
async fn main() -> Result<()> {
    println!(
        "{}",
        r#"
    ███████╗ ██████╗ ██████╗ ███████╗███████╗████████╗██████╗  ██████╗ ████████╗
    ██╔════╝██╔═══██╗██╔══██╗██╔════╝██╔════╝╚══██╔══╝██╔══██╗██╔═══██╗╚══██╔══╝
    █████╗  ██║   ██║██████╔╝█████╗  ███████╗   ██║   ██████╔╝██║   ██║   ██║
    ██╔══╝  ██║   ██║██╔══██╗██╔══╝  ╚════██║   ██║   ██╔══██╗██║   ██║   ██║
    ██║     ╚██████╔╝██║  ██║███████╗███████║   ██║   ██████╔╝╚██████╔╝   ██║
    ╚═╝      ╚═════╝ ╚═╝  ╚═╝╚══════╝╚══════╝   ╚═╝   ╚═════╝  ╚═════╝    ╚═╝
"#
            .green()
    );

    println!("               Made by Febzey#1854. Ported to Rust by bacon_cat_");

    let state = AppState::load().await?;
    let options = state.options()?;

    println!("{:#?}", options);

    Ok(())
}
